---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
PointCloudFilterUtils Members
PointCloudFilterUtils Class Methods See Also Send Feedback
---

The PointCloudFilterUtils type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | GetFilteredOutline | Computes outline of a part of a box that satisfies given PointCloudFilter. |

# See Also

PointCloudFilterUtils Class

Autodesk.Revit.DB.PointClouds Namespace